{
  "sportsInfo": {
    "futbol": {
      "title": "Fútbol - El Deporte Rey",
      "content": "<div class=\"sport-info\"><div class=\"sport-intro\"><h3><i class=\"fas fa-history\"></i> Historia y Orígenes del Fútbol</h3><p>El fútbol, conocido como soccer en algunos países, es indiscutiblemente el deporte más popular del mundo con más de 4 mil millones de seguidores. Sus orígenes se remontan a civilizaciones antiguas como China, Grecia y Roma, pero el fútbol moderno nació en Inglaterra durante el siglo XIX.</p><p>La Football Association (FA) se fundó en 1863 en Londres, estableciendo las primeras reglas oficiales del juego. Desde entonces, el fútbol se ha expandido globalmente, convirtiéndose en un fenómeno cultural que trasciende fronteras, idiomas y clases sociales.</p></div><div class=\"sport-rules\"><h3><i class=\"fas fa-gavel\"></i> Reglas Fundamentales</h3><ul><li><strong>Equipos:</strong> Dos equipos de 11 jugadores cada uno, incluyendo un portero</li><li><strong>Objetivo:</strong> Marcar más goles que el equipo contrario introduciendo el balón en la portería</li><li><strong>Duración:</strong> 90 minutos divididos en dos tiempos de 45 minutos cada uno</li><li><strong>Campo:</strong> Rectangular, entre 90-120 metros de largo y 45-90 metros de ancho</li><li><strong>Balón:</strong> Esférico, circunferencia entre 68-70 cm y peso entre 410-450 gramos</li><li><strong>Fuera de juego:</strong> Un jugador está en posición antirreglamentaria si está más cerca de la línea de gol que el balón y el penúltimo adversario</li><li><strong>Faltas:</strong> Incluyen patadas, empujones, sujetar al adversario, tocar el balón con las manos (excepto el portero en su área)</li></ul></div><div class=\"sport-competitions\"><h3><i class=\"fas fa-trophy\"></i> Competiciones Principales</h3><div class=\"competition-grid\"><div class=\"competition-item\"><h4>Copa Mundial FIFA</h4><p>El torneo más prestigioso del fútbol mundial, celebrado cada cuatro años desde 1930. Reúne a las 32 mejores selecciones nacionales del planeta.</p></div><div class=\"competition-item\"><h4>UEFA Champions League</h4><p>La competición de clubes más importante de Europa, donde participan los mejores equipos del continente europeo.</p></div><div class=\"competition-item\"><h4>Copa América</h4><p>El torneo de selecciones más antiguo del mundo, disputado por los países de América del Sur desde 1916.</p></div><div class=\"competition-item\"><h4>Eurocopa</h4><p>Campeonato europeo de selecciones que se celebra cada cuatro años, alternando con el Mundial.</p></div></div></div><div class=\"sport-benefits\"><h3><i class=\"fas fa-heart\"></i> Beneficios para la Salud</h3><div class=\"benefits-grid\"><div class=\"benefit-item\"><i class=\"fas fa-heartbeat\"></i><h4>Cardiovascular</h4><p>Mejora significativamente la resistencia cardiovascular y reduce el riesgo de enfermedades cardíacas.</p></div><div class=\"benefit-item\"><i class=\"fas fa-dumbbell\"></i><h4>Fuerza Muscular</h4><p>Fortalece especialmente los músculos de las piernas, core y mejora la potencia general del cuerpo.</p></div><div class=\"benefit-item\"><i class=\"fas fa-balance-scale\"></i><h4>Coordinación</h4><p>Desarrolla la coordinación motora, equilibrio y agilidad a través de movimientos complejos.</p></div><div class=\"benefit-item\"><i class=\"fas fa-users\"></i><h4>Social</h4><p>Fomenta el trabajo en equipo, la comunicación y las habilidades sociales.</p></div></div></div><div class=\"sport-facts\"><h3><i class=\"fas fa-lightbulb\"></i> Datos Curiosos</h3><ul><li>El fútbol se juega en más de 200 países y territorios</li><li>La final del Mundial 2018 fue vista por más de 1.1 mil millones de personas</li><li>El gol más rápido en la historia se marcó a los 2.8 segundos del inicio</li><li>Brasil es el único país que ha participado en todas las Copas del Mundo</li><li>El estadio más grande del mundo es el Rungrado 1º de Mayo en Corea del Norte (150,000 espectadores)</li></ul></div></div>"
    },
    "volleyball": {
      "title": "Volleyball - Deporte de Precisión y Estrategia",
      "content": "<div class=\"sport-info\"><div class=\"sport-intro\"><h3><i class=\"fas fa-history\"></i> Historia del Volleyball</h3><p>El volleyball fue inventado en 1895 por William G. Morgan en Holyoke, Massachusetts, Estados Unidos. Morgan, quien trabajaba en la YMCA, buscaba crear un deporte que combinara elementos del baloncesto, béisbol, tenis y balonmano, pero que fuera menos intenso físicamente que el baloncesto.</p><p>Originalmente llamado \"Mintonette\", el juego evolucionó rápidamente y adoptó su nombre actual cuando un espectador comentó que los jugadores estaban \"volleying\" (golpeando) la pelota de un lado a otro. El deporte se expandió internacionalmente y se convirtió en deporte olímpico en 1964.</p></div><div class=\"sport-rules\"><h3><i class=\"fas fa-gavel\"></i> Reglas y Mecánicas del Juego</h3><ul><li><strong>Equipos:</strong> Dos equipos de 6 jugadores cada uno en la cancha</li><li><strong>Objetivo:</strong> Enviar el balón al campo contrario para que toque el suelo o forzar un error del equipo rival</li><li><strong>Toques:</strong> Cada equipo puede tocar el balón máximo 3 veces antes de enviarlo al campo contrario</li><li><strong>Rotación:</strong> Los jugadores rotan en sentido horario cada vez que recuperan el saque</li><li><strong>Puntuación:</strong> Los sets se juegan a 25 puntos (diferencia mínima de 2 puntos)</li><li><strong>Partidos:</strong> Se juegan al mejor de 5 sets (el 5º set se juega a 15 puntos)</li><li><strong>Red:</strong> Altura de 2.43m para hombres y 2.24m para mujeres</li><li><strong>Cancha:</strong> 18m x 9m dividida por una red central</li></ul></div><div class=\"sport-positions\"><h3><i class=\"fas fa-users\"></i> Posiciones y Roles</h3><div class=\"positions-grid\"><div class=\"position-item\"><h4>Colocador/Armador</h4><p>El cerebro del equipo, responsable de distribuir el balón y organizar las jugadas ofensivas.</p></div><div class=\"position-item\"><h4>Opuesto</h4><p>Atacante principal que juega opuesto al colocador, especialista en ataques potentes.</p></div><div class=\"position-item\"><h4>Central/Medio</h4><p>Especialista en bloqueo y ataques rápidos en el centro de la red.</p></div><div class=\"position-item\"><h4>Receptor/Punta</h4><p>Jugador versátil que ataca, recibe y defiende, fundamental en la recepción del saque.</p></div><div class=\"position-item\"><h4>Líbero</h4><p>Especialista defensivo que no puede atacar ni bloquear, experto en recepción y defensa.</p></div></div></div><div class=\"sport-competitions\"><h3><i class=\"fas fa-trophy\"></i> Competiciones Internacionales</h3><div class=\"competition-grid\"><div class=\"competition-item\"><h4>Juegos Olímpicos</h4><p>La máxima competición del volleyball mundial, tanto en modalidad indoor como de playa.</p></div><div class=\"competition-item\"><h4>Liga Mundial/Liga de Naciones</h4><p>Competición anual que reúne a las mejores selecciones nacionales del mundo.</p></div><div class=\"competition-item\"><h4>Campeonato Mundial</h4><p>Se celebra cada cuatro años y es considerado el segundo torneo más importante después de los Juegos Olímpicos.</p></div><div class=\"competition-item\"><h4>Copa del Mundo</h4><p>Torneo clasificatorio para los Juegos Olímpicos que se celebra cada cuatro años.</p></div></div></div><div class=\"sport-variants\"><h3><i class=\"fas fa-beach\"></i> Modalidades del Volleyball</h3><div class=\"variants-grid\"><div class=\"variant-item\"><h4>Volleyball Indoor</h4><p>La modalidad tradicional jugada en pista cubierta con 6 jugadores por equipo.</p></div><div class=\"variant-item\"><h4>Volleyball de Playa</h4><p>Se juega en arena con equipos de 2 jugadores, requiere mayor resistencia física.</p></div><div class=\"variant-item\"><h4>Volleyball Sentado</h4><p>Modalidad paralímpica donde los jugadores permanecen sentados durante todo el juego.</p></div><div class=\"variant-item\"><h4>Volleyball de Nieve</h4><p>Variante jugada en nieve, popular en países con climas fríos.</p></div></div></div><div class=\"sport-benefits\"><h3><i class=\"fas fa-heart\"></i> Beneficios Físicos y Mentales</h3><div class=\"benefits-grid\"><div class=\"benefit-item\"><i class=\"fas fa-eye\"></i><h4>Coordinación Ojo-Mano</h4><p>Mejora significativamente la coordinación y los reflejos a través de movimientos precisos.</p></div><div class=\"benefit-item\"><i class=\"fas fa-bolt\"></i><h4>Agilidad y Velocidad</h4><p>Desarrolla la capacidad de reacción rápida y movimientos explosivos.</p></div><div class=\"benefit-item\"><i class=\"fas fa-brain\"></i><h4>Estrategia Mental</h4><p>Fomenta el pensamiento táctico y la toma de decisiones bajo presión.</p></div><div class=\"benefit-item\"><i class=\"fas fa-handshake\"></i><h4>Trabajo en Equipo</h4><p>Desarrolla habilidades de comunicación y cooperación esenciales.</p></div></div></div></div>"
    },
    "basketball": {
      "title": "Basketball - El Espectáculo del Deporte",
      "content": "<div class=\"sport-info\"><div class=\"sport-intro\"><h3><i class=\"fas fa-history\"></i> Orígenes e Historia del Basketball</h3><p>El baloncesto fue inventado en diciembre de 1891 por el Dr. James Naismith en Springfield, Massachusetts. Como instructor de educación física en la YMCA International Training School, Naismith necesitaba crear una actividad deportiva de interior durante los duros inviernos de Nueva Inglaterra.</p><p>El primer juego se jugó con cestas de melocotones clavadas a una galería elevada y una pelota de fútbol. El deporte evolucionó rápidamente, y en 1936 se convirtió en deporte olímpico. La creación de la NBA en 1946 marcó el inicio de la profesionalización del baloncesto, convirtiéndolo en uno de los deportes más populares y lucrativos del mundo.</p></div><div class=\"sport-rules\"><h3><i class=\"fas fa-gavel\"></i> Reglas y Fundamentos</h3><ul><li><strong>Equipos:</strong> Dos equipos de 5 jugadores cada uno en la cancha</li><li><strong>Objetivo:</strong> Anotar más puntos que el equipo contrario introduciendo el balón en la canasta</li><li><strong>Duración:</strong> 4 cuartos de 12 minutos (NBA) o 2 tiempos de 20 minutos (FIBA)</li><li><strong>Cancha:</strong> 28m x 15m (FIBA) o 28.7m x 15.2m (NBA)</li><li><strong>Canasta:</strong> Aro de 45cm de diámetro a 3.05m de altura</li><li><strong>Puntuación:</strong> 1 punto (tiro libre), 2 puntos (canasta normal), 3 puntos (desde la línea de tres)</li><li><strong>Reloj de posesión:</strong> 24 segundos para intentar un tiro (NBA/FIBA)</li><li><strong>Faltas:</strong> 5 faltas personales eliminan al jugador (NBA) o 6 faltas (FIBA)</li></ul></div><div class=\"sport-positions\"><h3><i class=\"fas fa-users\"></i> Posiciones Clásicas</h3><div class=\"positions-grid\"><div class=\"position-item\"><h4>Base (Point Guard)</h4><p>El director de orquesta del equipo, responsable de organizar las jugadas y distribuir el balón. Generalmente el jugador más bajo pero con mejor visión de juego.</p></div><div class=\"position-item\"><h4>Escolta (Shooting Guard)</h4><p>Especialista en el tiro exterior y creación de jugadas ofensivas. Combina habilidades de anotación con capacidad atlética.</p></div><div class=\"position-item\"><h4>Alero (Small Forward)</h4><p>Jugador versátil que puede anotar desde cualquier posición, defender múltiples posiciones y contribuir en el rebote.</p></div><div class=\"position-item\"><h4>Ala-Pívot (Power Forward)</h4><p>Jugador fuerte que opera cerca del aro, especialista en rebote ofensivo y defensivo, con capacidad de anotación interior.</p></div><div class=\"position-item\"><h4>Pívot (Center)</h4><p>Generalmente el jugador más alto, domina la zona pintada, especialista en bloqueos, rebotes y anotación cerca del aro.</p></div></div></div><div class=\"sport-competitions\"><h3><i class=\"fas fa-trophy\"></i> Ligas y Competiciones Principales</h3><div class=\"competition-grid\"><div class=\"competition-item\"><h4>NBA (National Basketball Association)</h4><p>La liga de baloncesto más prestigiosa del mundo, con 30 equipos de Estados Unidos y Canadá. Los playoffs culminan con las NBA Finals.</p></div><div class=\"competition-item\"><h4>EuroLiga</h4><p>La competición de clubes más importante de Europa, que reúne a los mejores equipos del continente europeo.</p></div><div class=\"competition-item\"><h4>Copa Mundial FIBA</h4><p>Campeonato mundial de selecciones que se celebra cada cuatro años, considerado el segundo torneo más importante después de los Juegos Olímpicos.</p></div><div class=\"competition-item\"><h4>March Madness (NCAA)</h4><p>Torneo universitario estadounidense que genera enorme expectación y es considerado uno de los eventos deportivos más emocionantes.</p></div></div></div><div class=\"sport-skills\"><h3><i class=\"fas fa-star\"></i> Habilidades Fundamentales</h3><div class=\"skills-grid\"><div class=\"skill-item\"><h4>Dribbling</h4><p>Control del balón con una mano mientras se mueve por la cancha, fundamental para crear espacios y oportunidades.</p></div><div class=\"skill-item\"><h4>Tiro</h4><p>Técnica para anotar desde diferentes distancias y ángulos, incluyendo tiros libres, de campo y triples.</p></div><div class=\"skill-item\"><h4>Pase</h4><p>Habilidad para distribuir el balón a los compañeros de manera precisa y oportuna.</p></div><div class=\"skill-item\"><h4>Rebote</h4><p>Capacidad para recuperar el balón después de un tiro fallido, tanto en ataque como en defensa.</p></div><div class=\"skill-item\"><h4>Defensa</h4><p>Técnicas para impedir que el equipo contrario anote, incluyendo defensa individual y por zonas.</p></div></div></div><div class=\"sport-benefits\"><h3><i class=\"fas fa-heart\"></i> Beneficios Integrales</h3><div class=\"benefits-grid\"><div class=\"benefit-item\"><i class=\"fas fa-running\"></i><h4>Condición Física</h4><p>Mejora la resistencia cardiovascular, fuerza, velocidad y agilidad a través de movimientos constantes.</p></div><div class=\"benefit-item\"><i class=\"fas fa-brain\"></i><h4>Agilidad Mental</h4><p>Desarrolla la capacidad de tomar decisiones rápidas bajo presión y mejora la concentración.</p></div><div class=\"benefit-item\"><i class=\"fas fa-balance-scale\"></i><h4>Coordinación</h4><p>Perfecciona la coordinación mano-ojo, equilibrio y control corporal a través de movimientos complejos.</p></div><div class=\"benefit-item\"><i class=\"fas fa-users\"></i><h4>Habilidades Sociales</h4><p>Fomenta el liderazgo, trabajo en equipo y comunicación efectiva entre compañeros.</p></div></div></div><div class=\"sport-facts\"><h3><i class=\"fas fa-lightbulb\"></i> Datos Fascinantes</h3><ul><li>Michael Jordan es considerado por muchos como el mejor jugador de todos los tiempos</li><li>Wilt Chamberlain anotó 100 puntos en un solo juego en 1962</li><li>La NBA genera más de 8 mil millones de dólares anuales en ingresos</li><li>El baloncesto se juega en más de 200 países y territorios</li><li>Kareem Abdul-Jabbar es el máximo anotador en la historia de la NBA con 38,387 puntos</li><li>El Dream Team de 1992 es considerado el mejor equipo de baloncesto jamás formado</li></ul></div></div>"
    }
  },
  "botResponses": {
    "default": [
      "Esa es una excelente pregunta sobre deportes. ¿Te gustaría saber más sobre algún deporte en particular?",
      "Interesante pregunta. Los deportes son una gran forma de mantenerse activo y saludable.",
      "Me encanta hablar de deportes. ¿Hay algún deporte específico que te interese más?",
      "¡Qué buena pregunta! El mundo del deporte es fascinante y lleno de historia."
    ],
    "futbol": [
      "El fútbol es realmente el deporte rey. ¿Sabías que se juega en más de 200 países?",
      "¡El fútbol es increíble! La Copa Mundial es el evento deportivo más visto del planeta.",
      "El fútbol desarrolla excelentes habilidades de trabajo en equipo y resistencia física."
    ],
    "volleyball": [
      "El volleyball es un deporte muy completo que mejora la coordinación y agilidad.",
      "¿Sabías que el volleyball de playa es muy popular y también es deporte olímpico?",
      "El volleyball es excelente para desarrollar reflejos rápidos y trabajo en equipo."
    ],
    "basketball": [
      "El basketball es un deporte muy dinámico que requiere mucha agilidad y precisión.",
      "La NBA ha popularizado el basketball en todo el mundo con jugadores increíbles.",
      "El basketball es excelente para mejorar la coordinación mano-ojo y la toma de decisiones."
    ],
    "saludo": [
      "¡Hola! Soy tu asistente deportivo. ¿En qué puedo ayudarte hoy?",
      "¡Bienvenido! Estoy aquí para responder tus preguntas sobre deportes.",
      "¡Hola! Me encanta hablar de deportes. ¿Qué te gustaría saber?"
    ]
  },
  "players": [
    {
      "name": "Lionel Messi",
      "sport": "Fútbol",
      "description": "Delantero argentino, considerado uno de los mejores jugadores de la historia.",
      "icon": "fas fa-user-circle"
    },
    {
      "name": "LeBron James",
      "sport": "Basketball",
      "description": "Estrella del basketball, múltiple campeón de la NBA y líder histórico.",
      "icon": "fas fa-user-circle"
    },
    {
      "name": "Karch Kiraly",
      "sport": "Volleyball",
      "description": "Leyenda del volleyball, único jugador en ganar oro olímpico indoor y de playa.",
      "icon": "fas fa-user-circle"
    }
  ]
}
